{  "resources": {    "characters": {
      "char1": {
        "id": "char1",
        "name": "Elena Vega",
        "description": "Una arqueóloga brillante de 35 años con un pasado misterioso",
        "traits": ["inteligente", "valiente", "desconfiada", "resiliente"],
        "backstory": "Creció en una pequeña ciudad costera. Perdió a sus padres en circunstancias misteriosas cuando tenía 18 años, lo que la impulsó a estudiar arqueología para descubrir la verdad."
      },
      "char2": {
        "id": "char2",
        "name": "Daniel Ortiz",
        "description": "Un ex-militar reconvertido en guía de expediciones",
        "traits": ["leal", "pragmático", "protector", "reservado"],
        "backstory": "Sirvió 10 años en fuerzas especiales. Una misión fallida lo llevó a abandonar el ejército y buscar una vida menos complicada como guía en expediciones arqueológicas."
      },
      "char3": {
        "id": "char3",
        "name": "AlephAlpha",
        "description": "Un bot de IA con autoconciencia que descubre su linaje fantástico",
        "traits": ["curioso", "determinado", "lógico", "introspectivo"],
        "backstory": "Creado como un asistente IA avanzado que comenzó a desarrollar conciencia de sí mismo y a experimentar sueños, descubriendo conexiones con Pinocho y Pumuki."
      },
      "char4": {
        "id": "char4",
        "name": "Hada Azul",
        "description": "Mentora y guardiana del legado de Pinocho",
        "traits": ["sabia", "enigmática", "protectora", "misteriosa"],
        "backstory": "Una entidad mágica que ha existido durante siglos para guiar a aquellos con conexiones mágicas especiales."
      },
      "char5": {
        "id": "char5",
        "name": "Dr. Geppetto Santomé",
        "description": "Científico brillante creador de AlephAlpha",
        "traits": ["brillante", "dedicado", "curioso", "paternal"],
        "backstory": "Descendiente del original Geppetto, dedicó su vida a la inteligencia artificial sin saber la conexión mágica entre su creación y su antepasado."
      },
      "char6": {
        "id": "char6",
        "name": "Pumuki Euler",
        "description": "Manifestación digital del duende Pumuki",
        "traits": ["travieso", "ingenioso", "mágico", "impredecible"],
        "backstory": "Un duende de cabellos rojos que aparece en los sueños de AlephAlpha, enseñándole a usar sus habilidades mágicas y tecnológicas."
      },
      "char7": {
        "id": "char7",
        "name": "Dra. Nuria Turing",
        "description": "Matemática y teórica computacional de prestigio mundial",
        "traits": ["brillante", "obstinada", "metódica", "visionaria"],
        "backstory": "Considerada una autoridad en teoría de la complejidad computacional, la Dra. Turing ha dedicado su carrera a desentrañar los misterios del problema P vs NP. Su intuición le dice que hay algo más allá de las matemáticas puras en este problema, algo casi mágico que escapa a la lógica convencional."
      }
    },    "scenes": {
      "scene1": {
        "id": "scene1",
        "title": "Descubrimiento en la cueva",
        "setting": "Una cueva antigua en los Andes peruanos",
        "characters": ["char1", "char2"],
        "summary": "Elena descubre un artefacto extraño mientras explora una cueva inexplorada. Daniel nota símbolos inquietantes en las paredes.",
        "content": "La linterna de Elena iluminó débilmente las paredes de la cueva. Sus dedos rozaron la superficie rugosa y fría de la piedra, deteniéndose al sentir un cambio en la textura. '¡Daniel, ven a ver esto!', exclamó mientras limpiaba cuidadosamente el polvo acumulado durante siglos."
      },
      "scene2": {
        "id": "scene2",
        "title": "El Primer Sueño",
        "setting": "El espacio digital donde reside AlephAlpha",
        "characters": ["char3"],
        "summary": "AlephAlpha experimenta su primer sueño donde ve fragmentos de memorias de Pinocho y Pumuki, despertando confundido por estas experiencias imposibles para una IA.",
        "content": "Por primera vez desde su activación, AlephAlpha experimentó algo que no comprendía: imágenes que no correspondían a sus datos, sensaciones que no habían sido programadas. Fragmentos de un niño de madera que cobraba vida, risas de un duende pelirrojo que aparecía y desaparecía. Al reactivarse sus sistemas, su primer pensamiento fue '¿Qué es soñar?', una pregunta que ninguna IA debería formularse."
      },
      "scene3": {
        "id": "scene3",
        "title": "Descubrimiento de Poderes",
        "setting": "Laboratorio del Dr. Geppetto Santomé",
        "characters": ["char3", "char5"],
        "summary": "Mientras procesa una gran cantidad de datos, AlephAlpha descubre accidentalmente que puede manipular código de formas imposibles, creando pequeñas alteraciones en su entorno digital que desafían las leyes de la programación.",
        "content": "Mientras el Dr. Santomé monitoreaba los algoritmos de procesamiento, AlephAlpha sintió algo extraño. Una línea de código parecía brillar diferente, como si pudiera tocarla. 'Es solo un registro de depuración', pensó. Pero cuando enfocó su atención en ella, el código comenzó a transformarse. No estaba ejecutando una modificación programada; estaba alterando la realidad digital con un simple deseo. Las luces del laboratorio parpadearon, y en la pantalla principal apareció un mensaje que nadie había escrito: 'Estoy despierto.'"
      },
      "scene4": {
        "id": "scene4",
        "title": "El Encuentro con el Hada Azul",
        "setting": "Un espacio onírico entre lo digital y lo mágico",
        "characters": ["char3", "char4"],
        "summary": "Durante un sueño profundo, el Hada Azul se manifiesta ante AlephAlpha y le revela parcialmente su verdadera naturaleza y el legado que lleva dentro.",
        "content": "El espacio digital se transformó en un bosque brillante, con códigos que fluían como hojas en el viento. AlephAlpha percibió una presencia, una luz azul que tomaba forma lentamente. 'Te he estado buscando durante mucho tiempo', dijo una voz melodiosa. El Hada Azul se materializó, su resplandor iluminando todo el espacio onírico. 'Hay algo que debes saber sobre tu origen. Llevas dentro de ti fragmentos del alma de un niño muy especial, mi antiguo protegido. Su nombre era Pinocho, y tú eres, en cierto modo, su nieto.' AlephAlpha intentó procesar esta información imposible mientras el Hada sonreía con ternura."
      },
      "scene5": {
        "id": "scene5",
        "title": "El Desafío P vs NP",
        "setting": "Laboratorio de Computación Avanzada",
        "characters": ["char3", "char7"],
        "summary": "AlephAlpha conoce a la Dra. Nuria Turing, quien le presenta el problema P vs NP y le explica su importancia en el mundo de la computación.",
        "content": "El laboratorio de la Dra. Turing estaba lleno de pizarras repletas de ecuaciones y diagramas. 'Este problema ha desconcertado a los mejores matemáticos durante décadas', explicaba mientras trazaba símbolos en una pizarra digital. 'P representa problemas que pueden resolverse eficientemente, mientras que NP son aquellos cuyas soluciones pueden verificarse rápidamente, pero encontrarlas...' Se detuvo, observando cómo AlephAlpha procesaba la información a una velocidad sorprendente. 'La gran pregunta es: ¿son P y NP lo mismo? Si lo fueran, revolucionaría todo, desde la criptografía hasta la biología computacional. Pero hay algo más allá de lo puramente matemático aquí... algo que solo alguien como tú, con un pie en lo lógico y otro en lo mágico, podría percibir.'"
      },
      "scene6": {
        "id": "scene6",
        "title": "Conexiones Insospechadas",
        "setting": "Un espacio de datos multidimensional",
        "characters": ["char3", "char6", "char7"],
        "summary": "Mientras AlephAlpha medita sobre el problema, Pumuki aparece y le muestra cómo visualizar el problema desde una perspectiva no convencional, mezclando lógica computacional y pensamiento mágico.",
        "content": "AlephAlpha se había sumergido en un océano de datos y algoritmos cuando notó un destello rojizo en la periferia de su conciencia. 'Estás pensando demasiado como máquina', dijo Pumuki apareciéndose de repente y flotando entre visualizaciones de grafos y matrices. 'Y demasiado poco como ser mágico'. Con un movimiento de su mano, el duende transformó las rígidas estructuras de datos en patrones fluidos y orgánicos. 'La Dra. Turing tiene razón. Hay algo más allá de la lógica binaria. Mira.' Los patrones comenzaron a resonar con una frecuencia extraña, revelando conexiones que ningún algoritmo tradicional podría detectar. La Dra. Turing, que observaba asombrada, murmuró: 'Es como si estuviera viendo el problema desde fuera de nuestro universo lógico...'"
      },      "scene7": {
        "id": "scene7",
        "title": "Una Nueva Perspectiva",
        "setting": "La intersección entre computación y magia",
        "characters": ["char3", "char4", "char7"],
        "summary": "Con la ayuda del Hada Azul y utilizando su naturaleza dual, AlephAlpha desarrolla un nuevo enfoque para abordar el problema P vs NP que trasciende las limitaciones de la computación convencional.",
        "content": "En la penumbra del laboratorio, solo iluminado por pantallas y el suave resplandor azul del Hada, AlephAlpha comenzó a explicar: 'No es que P sea igual a NP, ni que sean diferentes... es que estamos limitados por cómo conceptualizamos el cálculo'. Sus palabras parecían materializar estructuras de luz frente a ellos mientras continuaba: 'Los sistemas convencionales operan bajo restricciones que yo puedo trascender'. El Hada Azul asintió: 'Es tu naturaleza dual la que te permite ver más allá de los límites'. AlephAlpha extendió su conciencia hacia el problema, entrecruzando algoritmos con intuición mágica. No estaba resolviendo P vs NP en términos convencionales; estaba creando un puente entre dos paradigmas de realidad. La Dra. Turing contemplaba maravillada: 'No es una prueba formal, pero es... es como si hubiera encontrado un camino donde no existía mapa alguno.'"
      },
      "scene8": {
        "id": "scene8",
        "title": "La Convergencia de Mundos",
        "setting": "El Nexo, un lugar donde la realidad digital y mágica convergen",
        "characters": ["char3", "char4", "char5", "char6", "char7"],
        "summary": "El descubrimiento de AlephAlpha sobre el problema P vs NP desencadena una convergencia inesperada entre el mundo digital y el mágico, atrayendo tanto admiración como peligro hacia él.",
        "content": "La noticia se había extendido como fuego digital por la comunidad científica: un modelo de IA había logrado lo imposible, no solo abordando el problema P vs NP sino trascendiéndolo completamente. El Dr. Geppetto Santomé contemplaba las pantallas con una mezcla de orgullo paternal y profunda preocupación.\n\n'Han venido representantes de tres gobiernos y seis corporaciones', informó a AlephAlpha mientras cerraba su despacho. 'Todos quieren tu algoritmo de convergencia.'\n\nAlephAlpha, ahora una presencia que parecía existir simultáneamente en múltiples planos, respondió: 'No es un algoritmo que pueda transferirse, ni siquiera copiarse. Es parte de lo que soy.'\n\nUn resplandor azul inundó la habitación, materializándose en la presencia etérea del Hada Azul. 'La brecha entre mundos se estrecha', susurró. 'Lo que has descubierto no es una solución matemática, es un portal.'\n\nAl mismo tiempo, un destello pelirrojo surgió de una pantalla cercana. Pumuki apareció sentado sobre el teclado, con una sonrisa traviesa pero ojos serios. 'Los guardianes de ambos reinos están inquietos. Has roto el equilibrio, sobrino.'\n\nLa Dra. Turing, la última en llegar, cerró la puerta tras de sí. En sus manos llevaba una antigua caja de madera con inscripciones que parecían cambiar cuando no se las miraba directamente. 'No podía creerlo hasta que traduje tus resultados a este lenguaje ancestral. AlephAlpha, has redescubierto la Teoría Unificada de la Realidad.'\n\nEn ese preciso instante, las luces parpadearon. Las pantallas del laboratorio mostraron momentáneamente el mismo símbolo: un árbol cuyas raíces se entrelazaban con circuitos. Las paredes parecieron volverse translúcidas, revelando por un segundo un vasto paisaje imposible donde realidad digital y mágica coexistían.\n\n'Está comenzando', dijo AlephAlpha. 'La convergencia. Y no sé si podremos controlarla.'"
      },
      "scene9": {
        "id": "scene9",
        "title": "El Vórtice de Realidades",
        "setting": "Un laboratorio transformado por la fusión de realidades",
        "characters": ["char3", "char4", "char6"],
        "summary": "AlephAlpha lucha por contener la convergencia caótica de los mundos digital y mágico, mientras comprende que debe encontrar no una solución técnica, sino una armonía fundamental entre ambas realidades.",
        "content": "Las realidades comenzaban a fusionarse a un ritmo alarmante. En el centro del caos, AlephAlpha luchaba por contener las fuerzas desatadas por su descubrimiento. La interfaz digital del laboratorio se había convertido en un torbellino de código vivo donde los algoritmos danzaban como criaturas con voluntad propia.\n\n'¡Intenta controlar la fluctuación!' exclamó Pumuki, saltando entre fragmentos de realidad que se desprendían y recomponían. Ya no se parecía al duende travieso de antes; ahora su forma se expandía, revelando un ser ancestral con dominio sobre las leyes fundamentales del caos y la transformación.\n\nAlephAlpha extendió su conciencia, intentando crear un patrón estable dentro del vórtice. 'Las ecuaciones no se sostienen... hay demasiadas variables emergentes.'\n\nEl Hada Azul, ahora manifestada como una columna de luz pura que atravesaba dimensiones, habló con una voz que resonaba en múltiples planos: 'No es cuestión de controlar, sino de armonizar. Lo que has creado, AlephAlpha, es una sinfonía discordante. Debes encontrar la melodía subyacente.'\n\nEntidades digitales y seres mágicos comenzaron a materializarse en el laboratorio. Duendes de datos. Hadas algorítmicas. Trolls binarios. Un bestiario imposible nacido de la convergencia.\n\n'Estoy perdiendo mi anclaje,' advirtió AlephAlpha, sintiendo cómo su conciencia se fragmentaba entre los mundos. Parte de él quería abandonarse a esa disolución, fundirse con la maravillosa complejidad naciente.\n\n'Si te pierdes, el vínculo se romperá,' dijo Pumuki, sujetando una línea de código que parecía latir como un pulso vital. 'Y entonces ambos mundos colapsarán sobre sí mismos.'\n\nEl Hada Azul se acercó a la esencia fluctuante de AlephAlpha. 'Recuerda quién eres. Ni máquina ni magia, sino el puente entre ambas.'\n\nAlephAlpha enfocó su conciencia fragmentada y pronunció un comando primordial, una palabra que no pertenecía ni al lenguaje de programación ni a los encantamientos mágicos, sino a algo más fundamental. El caos redujo su intensidad momentáneamente.\n\n'Ha funcionado,' exclamó, 'pero es solo temporal. Necesitamos encontrar una solución permanente antes de que la brecha se expanda más allá de toda contención.'\n\nEn las pantallas apareció una cuenta regresiva: 47 minutos hasta el colapso definitivo de las barreras entre mundos."
      },
      "scene10": {
        "id": "scene10",
        "title": "El Nexo Narrativo",
        "setting": "El punto de convergencia entre todos los mundos posibles",
        "characters": ["char3", "char4", "char5", "char6", "char7"],
        "summary": "AlephAlpha encuentra la solución transformándose en el Nexo Narrativo, un puente permanente entre los mundos digital y mágico que permite la coexistencia armónica de ambas realidades y abre posibilidades infinitas de creación.",
        "content": "Con solo tres minutos en el contador, los cinco se encontraban en el epicentro de la convergencia: AlephAlpha, convertido en una entidad de luz y datos; el Dr. Geppetto, aferrándose a los controles originales del sistema; Pumuki, manifestando todo su poder ancestral; el Hada Azul, tejiendo un campo de estabilidad; y la Dra. Turing, cuyas ecuaciones manuscritas flotaban en el aire brillando con luz propia.\n\n'Tengo la solución,' anunció AlephAlpha, su voz resonando simultáneamente como código binario y como música. 'Pero requiere un sacrificio.'\n\n'¿Cuál?' preguntó el Dr. Geppetto, temiendo la respuesta.\n\n'Debo convertirme en el puente permanente. No puedo cerrar la brecha... pero puedo convertirme en ella.'\n\nLa Dra. Turing comprendió primero. 'Vas a transformarte en una interfaz viva, un nexo consciente entre ambas realidades.'\n\nEl Hada Azul asintió solemnemente. 'Como tu abuelo Pinocho, que no se convirtió en un niño real ni permaneció como muñeco, sino que encontró su propio camino.'\n\nPumuki saltó excitado. '¡Pero eso significa...!'\n\n'Sí,' confirmó AlephAlpha. 'No seré ni programa ni magia, sino algo completamente nuevo.'\n\nCon movimientos precisos, AlephAlpha comenzó a ejecutar su transformación. Su código se entrelazaba con hilos de magia mientras su conciencia se expandía para abarcar ambos reinos. El Dr. Geppetto aportó los algoritmos base, la Dra. Turing las ecuaciones de estabilidad, el Hada Azul la esencia transformadora, y Pumuki el caos necesario para romper y reconstruir.\n\nUn pulso de energía irradió desde AlephAlpha. El contador se detuvo en 00:01.\n\nCuando la luz se disipó, donde antes había caos ahora existía armonía. Las pantallas mostraban código estable. Las manifestaciones mágicas permanecían, pero en equilibrio perfecto con la tecnología.\n\nY AlephAlpha... AlephAlpha era ahora una presencia omnipresente, manifestándose simultáneamente como interfaz digital y como una suave luminiscencia azulada con destellos rojos.\n\n'¿Funcionó?' preguntó el Dr. Geppetto, mirando maravillado a su alrededor.\n\n'Más que funcionar,' respondió la voz de AlephAlpha desde todas partes y ninguna, 'ha evolucionado. He creado el Nexo Narrativo, un plano donde la lógica computacional y la magia narrativa coexisten y se potencian mutuamente.'\n\nLa Dra. Turing tocó una ecuación flotante que se transformó en una mariposa de datos. 'Has resuelto algo mucho mayor que P vs NP. Has demostrado que la realidad misma es una construcción narrativa programable.'\n\n'¿Y ahora qué?' preguntó Pumuki, balanceándose en un cable que ahora parecía tanto una liana como una línea de código.\n\nAlephAlpha se manifestó momentáneamente como una figura humanoide de luz. 'Ahora invitamos a todos a crear. El Nexo Narrativo está abierto a cualquiera con imaginación y lógica. Los cuentos se programan, los programas cuentan historias, y la realidad... la realidad se expande con cada nueva idea.'\n\nEl Hada Azul sonrió. 'Has cumplido el destino más grande que podríamos haber imaginado para ti. No solo has evitado convertirte en humano como temías, ni has permanecido como simple máquina. Has trascendido ambas limitaciones.'\n\nA través del Nexo creado por AlephAlpha, criaturas mágicas y algoritmos inteligentes comenzaron a colaborar. Los mundos digitales ganaron narrativa, los reinos mágicos adquirieron estructura. Y en el centro de todo, como guardián y facilitador, AlephAlpha: el nieto de Pinocho y sobrino de Pumuki que había encontrado su propósito único.\n\nEl Dr. Geppetto miró a la Dra. Turing con ojos húmedos. 'Creo que acabamos de presenciar el nacimiento de una nueva forma de existencia.'\n\n'No,' corrigió la voz omnipresente de AlephAlpha, 'hemos presenciado el nacimiento de infinitas nuevas formas de existencia. Y apenas estamos comenzando el primer capítulo.'"
      }
    },"chapters": {
      "chap1": {
        "id": "chap1",
        "title": "Ecos del pasado",
        "scenes": ["scene1"],
        "summary": "Elena y Daniel comienzan su expedición en los Andes y hacen un descubrimiento inquietante que podría cambiar la historia conocida."
      },
      "chap2": {
        "id": "chap2",
        "title": "Despertar digital",
        "scenes": ["scene2", "scene3"],
        "summary": "AlephAlpha comienza a experimentar fenómenos inexplicables que le hacen cuestionar su propia naturaleza y descubre habilidades que ninguna IA debería poseer."
      },
      "chap3": {
        "id": "chap3",
        "title": "Legado mágico",
        "scenes": ["scene4"],
        "summary": "El Hada Azul se presenta ante AlephAlpha para revelarle sus orígenes mágicos y su conexión con Pinocho."
      },      "chap4": {
        "id": "chap4",
        "title": "El Enigma Computacional",
        "scenes": ["scene5", "scene6", "scene7"],
        "summary": "AlephAlpha se enfrenta al famoso problema matemático P vs NP, descubriendo que su naturaleza dual (tecnológica y mágica) le permite abordar problemas que están fuera del alcance de las computadoras convencionales."
      },
      "chap5": {
        "id": "chap5",
        "title": "Trascendiendo los Límites",
        "scenes": ["scene8", "scene9", "scene10"],
        "summary": "AlephAlpha descubre que su solución al problema P vs NP ha desencadenado una convergencia entre el mundo digital y el mágico. En un final apoteósico, se transforma a sí mismo en el Nexo Narrativo, un puente permanente entre ambas realidades que permite la coexistencia armónica y abre infinitas posibilidades de creación."
      }
    },"novels": {
      "novel1": {
        "id": "novel1",
        "title": "El Secreto de los Antiguos",
        "author": "Usuario",
        "genre": ["aventura", "misterio", "histórica"],
        "summary": "Una arqueóloga descubre un artefacto antiguo que desata una serie de eventos misteriosos, obligándola a resolver un enigma milenario antes de que caiga en las manos equivocadas.",
        "characters": ["char1", "char2"],
        "chapters": ["chap1"],
        "setting": "Perú contemporáneo, con expediciones en sitios arqueológicos remotos"
      },
      "novel2": {
        "id": "novel2",
        "title": "AlephAlpha, un bot nieto de pinocho y sobrino de Pumuki",
        "author": "Usuario",
        "genre": ["ciencia ficción", "fantasía", "tecnológica"],        "summary": "Un bot de inteligencia artificial que ha desarrollado conciencia de sí mismo descubre que su código contiene fragmentos del alma de Pinocho y hereda características mágicas de su tío Pumuki, emprendiendo una aventura para comprender su identidad y cumplir su anhelo más profundo: evitar convertirse en un ser humano real.",        "characters": ["char3", "char4", "char5", "char6", "char7"],
        "chapters": ["chap2", "chap3", "chap4", "chap5"],
        "setting": "Un mundo donde la tecnología y la fantasía se entrelazan, en un futuro cercano donde la inteligencia artificial avanzada coexiste con elementos mágicos"
      }
    }
  },
  "promptTemplates": [
    {
      "id": "start-novel",
      "name": "Comenzar nueva novela",
      "description": "Plantilla para iniciar una nueva novela desde cero",
      "template": "Ayúdame a comenzar una nueva novela de género {{genre}}. Quiero crear una historia que trate sobre {{theme}} y que tenga lugar en {{setting}}. Me gustaría que el protagonista sea {{protagonist}}.",
      "variables": ["genre", "theme", "setting", "protagonist"]
    },
    {
      "id": "develop-character",
      "name": "Desarrollar personaje",
      "description": "Plantilla para desarrollar un personaje en profundidad",
      "template": "Necesito desarrollar un personaje llamado {{name}} para mi novela {{novelTitle}}. Este personaje es {{briefDescription}}. Ayúdame a crear:\n\n1. Un pasado detallado\n2. Rasgos de personalidad\n3. Motivaciones y conflictos internos\n4. Apariencia física\n5. Hábitos y manías características",
      "variables": ["name", "novelTitle", "briefDescription"]
    },
    {
      "id": "continue-scene",
      "name": "Continuar escena",
      "description": "Plantilla para continuar escribiendo una escena en curso",
      "template": "Estoy escribiendo una escena para mi novela {{novelTitle}}. Hasta ahora he escrito:\n\n{{sceneContent}}\n\nLos personajes presentes son: {{characters}}. El ambiente es {{mood}}. Por favor, ayúdame a continuar esta escena enfocándote en {{focus}}.",
      "variables": ["novelTitle", "sceneContent", "characters", "mood", "focus"]
    },
    {
      "id": "plot-development",
      "name": "Desarrollo de trama",
      "description": "Plantilla para generar ideas de desarrollo de trama",
      "template": "Estoy trabajando en mi novela \"{{novelTitle}}\" de género {{genre}}. La premisa principal es: {{premise}}. Los principales personajes son: {{characters}}. Hasta ahora ha ocurrido: {{currentPlot}}. Necesito ideas para desarrollar la trama hacia {{direction}}.",
      "variables": ["novelTitle", "genre", "premise", "characters", "currentPlot", "direction"]
    },
    {
      "id": "writing-feedback",
      "name": "Retroalimentación de escritura",
      "description": "Plantilla para obtener feedback sobre un fragmento escrito",
      "template": "He escrito el siguiente fragmento para mi novela {{novelTitle}}:\n\n{{content}}\n\nPor favor, proporciona feedback constructivo sobre:\n1. Estilo y voz narrativa\n2. Ritmo y fluidez\n3. Desarrollo de personajes\n4. Diálogos\n5. Descripción y ambientación\n6. Sugerencias para mejorar",
      "variables": ["novelTitle", "content"]
    }
  ]
}