{
  "novels": [
    {
      "id": "novel1",
      "title": "El Secreto de los Antiguos",
      "author": "Usuario",
      "genre": [
        "aventura",
        "misterio",
        "histórica"
      ],
      "summary": "Una arqueóloga descubre un artefacto antiguo que desata una serie de eventos misteriosos, obligándola a resolver un enigma milenario antes de que caiga en las manos equivocadas.",
      "characters": [
        "char1",
        "char2"
      ],
      "chapters": [
        "chap1"
      ],
      "setting": "Perú contemporáneo, con expediciones en sitios arqueológicos remotos"
    }
  ],
  "characters": [
    {
      "id": "char1",
      "name": "Elena Vega",
      "description": "Una arqueóloga brillante de 35 años con un pasado misterioso",
      "traits": [
        "inteligente",
        "valiente",
        "desconfiada",
        "resiliente"
      ],
      "backstory": "Creció en una pequeña ciudad costera. Perdió a sus padres en circunstancias misteriosas cuando tenía 18 años, lo que la impulsó a estudiar arqueología para descubrir la verdad."
    },
    {
      "id": "char2",
      "name": "Daniel Ortiz",
      "description": "Un ex-militar reconvertido en guía de expediciones",
      "traits": [
        "leal",
        "pragmático",
        "protector",
        "reservado"
      ],
      "backstory": "Sirvió 10 años en fuerzas especiales. Una misión fallida lo llevó a abandonar el ejército y buscar una vida menos complicada como guía en expediciones arqueológicas."
    }
  ],
  "scenes": [
    {
      "id": "scene1",
      "title": "Descubrimiento en la cueva",
      "setting": "Una cueva antigua en los Andes peruanos",
      "characters": [
        "char1",
        "char2"
      ],
      "summary": "Elena descubre un artefacto extraño mientras explora una cueva inexplorada. Daniel nota símbolos inquietantes en las paredes.",
      "content": "La linterna de Elena iluminó débilmente las paredes de la cueva. Sus dedos rozaron la superficie rugosa y fría de la piedra, deteniéndose al sentir un cambio en la textura. '¡Daniel, ven a ver esto!', exclamó mientras limpiaba cuidadosamente el polvo acumulado durante siglos."
    }
  ]
}